#ให้ทำโปรแกรมคำนวณทามีที่ต้องใช้ทาดพ้านนอกของกล่องสี่เหลี่ยมขนาดใหญ่ 1 กล่องของทุกด้าน 
#ว่าต้องใช้สีกี่แกลลอนโดดยให้ผู้ใช้ป้อนความกว้าง ความยาว ความสูงของกล่อง (หน่วยเป็นเมตร) ทางแป้นพิมพ์
#และแสดงผลจำนวนแกลลอนที่ต้องใฃ้ทางหน้าจอ ดังนี้
#ให้แสดงผลโดยใช้ print ทั้ง 5 แบบ
#ทั้งนี้สี1 แกลลอนทาได้ 5 ตารางเมตร ทั้งนี้จำนวนแกลลอนที่คำนวณได้หากเป็นเลขทศนิยมให้ปัดเป็นเลขจำนวนเต็ม
#เช่น คำนวณได้ 15.239 แกลลอน เวลาแสดงผลเป็น 16 แกลลอนเป็นต้น

import math
width = float(input('ป้อนความกว้างของกล่อง (เมตร): '))
length = float(input('ป้อนความยาวของกล่อง (เมตร): '))
height = float(input('ป้อนความสูงของกล่อง (เมตร): '))
area = 2 * ( width * height + length * height)
paint = math.ceil(area/5)
print('.......................................')
print('กล่องกว้าง {:.2f} เมตร ยาว {:.2f} เมตร สูง {:.2f} เมตร'.format(width,length,height))
print('ใช้จำนวนสี {} แกลลอน'.format(paint))
print(f'กล่องกว้าง {width:.2f} เมตร ยาว {length:.2f} เมตร สูง {height:.2f} เมตร')
print(f'ใช้จำนวนสี {paint} แกลลอน')
print('กล่องกว้าง',f'{width:.2f}','เมตร','ยาว',f'{length:.2f}','เมตร','สูง',f'{height:.2f}','เมตร')
print('ใช้จำนวนสี',f'{paint:.2f}','แกลลอน')
print('กล่องกว้าง'+f'{width:.2f}'+' เมตร '+ ' ยาว '+f'{length:.2f}'+' เมตร'+' สูง '+f'{height:.2f}'+' เมตร')
print('ใช้จำนวนสี'+f'{paint:.2f}'+' แกลลอน')
print('กล่องกว้าง %.2f เมตร ยาว %.2f เมตร สูง %.2f เมตร' %(width,length,height))
print('ใช้จำนวนสี %.2f แกลลอน'%(paint))