#ให้ทำโปรแกรมป้อนจำนวนเงิน และจำนวนคนทางเป็นพิมพ์ และแสดลงผลออกมาว่า
#จำนวนเงินเป็น ??? บาท จำนวนคนกันคนละ ??? คน ต้องหารคนละ ??? บาท
#ให้แสดงผลโดดยใช้ print ทั้ง 5แบบ
money = input('ป้อนจำนวนเงิน : ')
person = input('ป้อนจำนวนคน : ')
final = float(money)/int(person)
print('............................................')
print(f'จำนวนเงินเป็น {money} บาท จำนวนคน {person} คน ต้องหารกันคนละ {final:.2f} บาท')
print('จำนวนเงินเป็น',money,'บาท','จำนวนคน',person,'คน','ต้องหารกันคนละ',f'{final:.2f}','บาท')
print('จำนวนเงินเป็น ' +money+' บาท'+' จำนวนคนกันคนละ '+person+' คน'+' ต้องหารกันคนละ 'f' {final:.2f}'+'บาท+')
print('จำนวนเงินเป็น {} บาท จำนวนคนกันคนละ {} คน ต้องหารคนละ {:.2f}บาท' .format(money,person,final)) #.format
print('จำนวนเงินเป็น %s บาท จำนวนคนกันคนละ %s คน ต้องหารคนละ %.2f บาท' %(money,person,final)) #%
